Revit 2026 API

# CompoundStructureGetSegmentIds Method

---

Gets the segment ids of this compound structure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> GetSegmentIds()
```
```vb
Public Function GetSegmentIds As IList(Of Integer)
```
```cpp
public:
IList<int>^ GetSegmentIds()
```
```fsharp
member GetSegmentIds : unit -> IList<int>
```

#### Return Value

IListInt32 The ids of the segments which form the boundary of the regions of this CompoundStructure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

The boundaries of the regions of a vertically compound structure consist of vertical horizontal segments with unique ids.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace